cfd_handover/code_from_cfd/smoke_test/case_files/system/controlDict
FoamFile { version 2.0; format ascii; class dictionary; object controlDict; }
application     simpleFoam;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         2000;
deltaT          1;
writeControl    timeStep;
writeInterval   250;
purgeWrite      2;
writeFormat     ascii;
writePrecision  8;
writeCompression off;
timeFormat      general;
timePrecision   8;
runTimeModifiable true;

functions
{
    inletFlux
    {
        type surfaceFieldValue; libs ("libfieldFunctionObjects.so");
        writeControl timeStep; writeInterval 1; writeFields false; log true;
        regionType patch; name inlet; operation sum; fields (phi);
    }
    outletFlux
    {
        type surfaceFieldValue; libs ("libfieldFunctionObjects.so");
        writeControl timeStep; writeInterval 1; writeFields false; log true;
        regionType patch; name outlet; operation sum; fields (phi);
    }
    outletPatchP
    {
        type surfaceFieldValue; libs ("libfieldFunctionObjects.so");
        writeControl timeStep; writeInterval 1; writeFields false; log true;
        regionType patch; name outlet; operation areaAverage; fields (p);
    }
    measurementP
    {
        type surfaceFieldValue; libs ("libfieldFunctionObjects.so");
        writeControl timeStep; writeInterval 1; writeFields false; log true;
        regionType sampledSurface; name measurementPlane;
        sampledSurfaceDict
        {
            type plane; planeType pointAndNormal;
            pointAndNormalDict { point (0.0565 0 0); normal (1 0 0); }
            interpolate false;
        }
        operation areaAverage; fields (p);
    }
}
