cfd_handover/code_from_cfd/smoke_test/case_files/0/U
FoamFile { version 2.0; format ascii; class volVectorField; object U; }
dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0.2 0 0);

boundaryField
{
    inlet   { type pressureInletOutletVelocity; value uniform (0 0 0); }
    outlet  { type inletOutlet; inletValue uniform (0 0 0); value uniform (0 0 0); }
    wall    { type noSlip; }
}
