cfd_handover/code_from_cfd/smoke_test/case_files/system/fvSolution
FoamFile { version 2.0; format ascii; class dictionary; object fvSolution; }
solvers
{
    p { solver GAMG; smoother GaussSeidel; tolerance 1e-08; relTol 0.01; }
    U { solver smoothSolver; smoother symGaussSeidel; tolerance 1e-09; relTol 0.1; }
}
SIMPLE
{
    nNonOrthogonalCorrectors 1;
}
relaxationFactors
{
    fields  { p 0.3; }
    equations { U 0.7; }
}
