cfd_handover/code_from_cfd/smoke_test/case_files/system/decomposeParDict.template
FoamFile { version 2.0; format ascii; class dictionary; object decomposeParDict; }
numberOfSubdomains  @NPROC@;
method              scotch;
